#Напишите программу, которая на вход принимает два числа A и B, 
#и возводит число А в целую степень B с помощью рекурсии.

namber1 = int(input('Введите первое число'))
namber2 = int(input('Введите второе число'))
a = pow(namber1 , namber2)
print (a)
